# Команды управления мультиконтейнеризацией
# Управление мультиконтейнеризацией осуществляется через команды make

include .env

# Запуск всех контейнеров
start:
	docker compose up -d

# Остановка всех контейнеров
stop:
	docker compose down

# Список всех контейнеров
list:
	docker compose ps

# Войти в контейнер c интерпретатором ЯП
# Для выполнения команд внутри контейнера под нужной версией
# Выбрать контейнер с ЯП, нужный раскомментить, ненужный закомментить
cli:
	docker exec -it ${APP_NAME}-php-fpm /bin/bash
